---
kind: property
id: P:Autodesk.Revit.DB.SpatialElementBoundaryOptions.SpatialElementBoundaryLocation
source: html/47e2311e-a363-7c6f-560d-cd7033251bbf.htm
---
# Autodesk.Revit.DB.SpatialElementBoundaryOptions.SpatialElementBoundaryLocation Property

The boundary of spatial element for geometry calculation.

## Syntax (C#)
```csharp
public SpatialElementBoundaryLocation SpatialElementBoundaryLocation { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration